#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602103066]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602103063]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602103062]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602103067]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602103074]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602103084]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602103073]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602103076]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602103065]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602103077]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602103069]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947038]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602103078]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602103068]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602103081]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602103079]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602103085]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602103080]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602103086]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602103082]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602103070]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602103072]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602103064]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602103087]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602103117]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602103119]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602103122]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602103130]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602103132]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602103121]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602103118]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602103120]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602103092]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602103093]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602103102]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602103072" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602103093" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602103064" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602103102" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602103070" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602103092" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103078" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602103121" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103086" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602103119" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103081" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602103117" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103079" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602103122" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103082" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602103132" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103080" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602103118" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103085" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602103120" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602103068" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602103130" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602103072",
        ] -> (known after apply)
        id                = "113602103093"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602103064",
        ] -> (known after apply)
        id                = "113602103102"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602103070",
        ] -> (known after apply)
        id                = "113602103092"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103078",
          - "113602103076",
        ] -> (known after apply)
        id                = "113602103121"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103086",
          - "113602103065",
        ] -> (known after apply)
        id                = "113602103119"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103081",
          - "113602103069",
        ] -> (known after apply)
        id                = "113602103117"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103079",
          - "113602103067",
        ] -> (known after apply)
        id                = "113602103122"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103082",
          - "113602103074",
        ] -> (known after apply)
        id                = "113602103132"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103080",
          - "113602103077",
        ] -> (known after apply)
        id                = "113602103118"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103085",
          - "113602103073",
        ] -> (known after apply)
        id                = "113602103120"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602103068",
          - "113602103084",
        ] -> (known after apply)
        id                = "113602103130"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>